XML_AVISOS_PENDENTES_MNI3.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  EXEMPLO DE XML ENVIADO PARA CONSULTAR AVISOS PENDENTES - MNI 3.0

  Este é o XML que será montado e enviado para o serviço consultarAvisosPendentes
  do MNI 3.0 quando você clica em "Atualizar" em "Avisos Pendentes" selecionando
  "Execução Fiscal".

  Baseado na documentação oficial (pergunta.txt)
-->

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:v300="http://www.cnj.jus.br/mni/v300/"
    xmlns:tip="http://www.cnj.jus.br/mni/v300/tipos-servico-intercomunicacao"
    xmlns:int="http://www.cnj.jus.br/mni/v300/intercomunicacao">

  <soapenv:Header/>

  <soapenv:Body>
    <v300:requisicaoConsultarAvisosPendentes>

      <!-- AUTENTICAÇÃO SIMPLES -->
      <tip:consultante>
        <int:autenticacaoSimples>
          <int:usuario>SEU_USUARIO_AQUI</int:usuario>
          <int:senha>HASH_SHA256_COM_DATA_AQUI</int:senha>
        </int:autenticacaoSimples>
      </tip:consultante>

      <!-- TIPO DE PENDÊNCIA: PC = Pendente de Ciência (Aguardando Abertura) -->
      <!-- Valores possíveis: PC (Pendente de Ciência), PR (Pendente de Resposta), AM (Ambos) -->
      <tip:tipoPendencia>PC</tip:tipoPendencia>

      <!-- PARÂMETROS ADICIONAIS OBRIGATÓRIOS -->
      <!-- todosPrazos: true = retorna prazos aguardando + já abertos -->
      <tip:outroParametro nome="todosPrazos" valor="true"/>

      <!-- informacoesDetalhadas: true = retorna fields como identificadorMovimento, descricaoMovimento, etc -->
      <tip:outroParametro nome="informacoesDetalhadas" valor="true"/>

      <!-- OPCIONAL: Filtro de avisos por tipo (CIT, INT, IDP, IDC, IAD, IST, IAC, NOT, VIS, URG, PTA) -->
      <!-- <tip:tiposAviso>CIT</tip:tiposAviso>  -->

    </v300:requisicaoConsultarAvisosPendentes>
  </soapenv:Body>

</soapenv:Envelope>


<!--
  ====================================================================
  RESPOSTA ESPERADA DO SERVIDOR (SUCESSO):
  ====================================================================
-->

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns1="http://www.cnj.jus.br/mni/v300/intercomunicacao"
    xmlns:ns2="http://www.cnj.jus.br/mni/v300/tipos-servico-intercomunicacao"
    xmlns:ns3="http://www.cnj.jus.br/mni/v300/">

  <SOAP-ENV:Body>
    <ns3:respostaConsultarAvisosPendentes>

      <!-- RECIBO COM STATUS DA OPERAÇÃO -->
      <ns2:recibo>
        <ns1:sucesso>true</ns1:sucesso>
        <ns1:mensagens>
          <ns1:descritivo>Consulta realizada com sucesso {'dataAtualizacao': '20250730094412'}</ns1:descritivo>
          <ns1:codigo/>
          <ns1:codigoUnico/>
          <ns1:tipo>INFORMACAO</ns1:tipo>
        </ns1:mensagens>
      </ns2:recibo>

      <!-- LISTA DE AVISOS PENDENTES -->
      <ns2:avisos>
        <ns1:idAviso>202507296000030</ns1:idAviso>
        <ns1:tipoComunicacao>CIT</ns1:tipoComunicacao>

        <!-- INFORMAÇÃO DO DESTINATÁRIO -->
        <ns1:destinatario>
          <ns1:nome>ENTIDADE-TESTE</ns1:nome>
          <ns1:qualificacaoPessoa>JUR</ns1:qualificacaoPessoa>
          <ns1:numeroDocumentoPrincipal>12569545000100</ns1:numeroDocumentoPrincipal>
        </ns1:destinatario>

        <!-- INFORMAÇÃO DO PROCESSO -->
        <ns1:processo>
          <ns1:numero>40003304620258260100</ns1:numero>
          <ns1:classeProcessual>7</ns1:classeProcessual>
          <ns1:orgaoJulgador>
            <ns1:codigo>100002602</ns1:codigo>
            <ns1:nome>Juízo Titular II - 26ª Vara Cível - Foro Central Cível</ns1:nome>
            <ns1:instancia>ORIG</ns1:instancia>
            <ns1:codigoLocalidade>3550308</ns1:codigoLocalidade>
          </ns1:orgaoJulgador>
          <ns1:outroParametro nome="rito" valor="2"/>
          <ns1:outroParametro nome="ritoProcessual" valor="Ordinário"/>
          <ns1:outroParametro nome="assuntoPrincipal" valor="11974"/>
          <ns1:outroParametro nome="dataAutuacao" valor="20250707181709"/>
          <ns1:outroParametro nome="situacao" valor="MOVIMENTO"/>
        </ns1:processo>

        <!-- INFORMAÇÃO DO REMETENTE -->
        <ns1:remetente>
          <ns1:codigo>100002602</ns1:codigo>
          <ns1:nome>Juízo Titular II - 26ª Vara Cível - Foro Central Cível</ns1:nome>
          <ns1:instancia>ORIG</ns1:instancia>
          <ns1:codigoLocalidade>3550308</ns1:codigoLocalidade>
        </ns1:remetente>

        <!-- DADOS DO AVISO E PRAZO -->
        <ns1:numeroProcesso>40003304620258260100</ns1:numeroProcesso>
        <ns1:dataDisponibilizacao>2025-07-29T10:19:32-03:00</ns1:dataDisponibilizacao>
        <ns1:tipoPrazo>DATA_CERTA</ns1:tipoPrazo>
        <ns1:prazo>15</ns1:prazo>

        <!-- INFORMAÇÕES DETALHADAS DA MOVIMENTAÇÃO (padrão informacoesDetalhadas=true) -->
        <ns1:outroParametro nome="identificadorMovimento" valor="3"/>
        <ns1:outroParametro nome="descricaoMovimento" valor="Expedida/certificada a citação eletrônica"/>
        <ns1:outroParametro nome="dataHoraMovimento" valor="20250709171131"/>
        <ns1:outroParametro nome="codigoMovimento" valor="540400422"/>
        <ns1:outroParametro nome="codigoCNJ" valor="12287"/>
        <ns1:outroParametro nome="prazo" valor="15"/>
        <ns1:outroParametro nome="status" valor="Aberto"/>
        <ns1:outroParametro nome="inicioPrazo" valor="20250722000000"/>
        <ns1:outroParametro nome="finalPrazo" valor="20250811235959"/>

      </ns2:avisos>

    </ns3:respostaConsultarAvisosPendentes>
  </SOAP-ENV:Body>

</SOAP-ENV:Envelope>


<!--
  ====================================================================
  DEPOIS DE ATUALIZAR O SERVIDOR, VOCÊ VERÁ NO CONSOLE:
  ====================================================================

  [MNI 3.0] ========================================
  [MNI 3.0] XML ENVIADO PARA MNI 3.0:
  (aqui aparecerá o XML REQUEST completo que foi enviado)

  [MNI 3.0] ========================================
  [MNI 3.0] XML RESPOSTA MNI 3.0:
  (aqui aparecerá o XML RESPONSE completo recebido do servidor)

  Esse XML que aparecerá no console será idêntico ou muito similar ao
  exemplo acima. Assim você saberá exatamente qual XML está sendo
  enviado para o servidor MNI 3.0.
-->
